[{"model": "control.article", "pk": 1, "fields": {"title": "C", "author": 1, "created": "2025-04-23T13:46:00.183Z", "synopsis": "Programming language", "content": "C is a general-purpose programming language. It was created in the 1970s by Dennis Ritchie and remains very widely used and influential. By design, C's features cleanly reflect the capabilities of the targeted CPUs. It has found lasting use in operating systems code (especially in kernels), device drivers, and protocol stacks, but its use in application software has been decreasing. C is commonly used on computer architectures that range from the largest supercomputers to the smallest microcontrollers and embedded systems.\r\nA successor to the programming language B, C was originally developed at Bell Labs by Ritchie between 1972 and 1973 to construct utilities running on Unix. It was applied to re-implementing the kernel of the Unix operating system. During the 1980s, C gradually gained popularity. It has become one of the most widely used programming languages, with C compilers available for practically all modern computer architectures and operating systems. The book The C Programming Language, co-authored by the original language designer, served for many years as the de facto standard for the language. C has been standardized since 1989 by the American National Standards Institute (ANSI) and, subsequently, jointly by the International Organization for Standardization (ISO) and the International Electrotechnical Commission (IEC).\r\nC is an imperative procedural language, supporting structured programming, lexical variable scope, and recursion, with a static type system. It was designed to be compiled to provide low-level access to memory and language constructs that map efficiently to machine instructions, all with minimal runtime support. Despite its low-level capabilities, the language was designed to encourage cross-platform programming. A standards-compliant C program written with portability in mind can be compiled for a wide variety of computer platforms and operating systems with few changes to its source code.\r\nSince 2000, C has consistently ranked among the top four languages in the TIOBE index, a measure of the popularity of programming languages."}}, {"model": "control.article", "pk": 2, "fields": {"title": "C++", "author": 1, "created": "2025-04-23T13:49:21.781Z", "synopsis": "Programming language", "content": "C++  is a high-level, general-purpose programming language created by Danish computer scientist Bjarne Stroustrup. First released in 1985 as an extension of the C programming language, adding object-oriented (OOP) features, it has since expanded significantly over time adding more OOP and other features; as of 1997/C++98 standardization, C++ has added functional features, in addition to facilities for low-level memory manipulation for systems like microcomputers or to make operating systems like Linux or Windows, and even later came features like generic (template) programming. C++ is usually implemented as a compiled language, and many vendors provide C++ compilers, including the Free Software Foundation, LLVM, Microsoft, Intel, Embarcadero, Oracle, and IBM.\r\nC++ was designed with systems programming and embedded, resource-constrained software and large systems in mind, with performance, efficiency, and flexibility of use as its design highlights. C++ has also been found useful in many other contexts, with key strengths being software infrastructure and resource-constrained applications, including desktop applications, video games, servers (e.g., e-commerce, web search, or databases), and performance-critical applications (e.g., telephone switches or space probes).\r\nC++ is standardized by the International Organization for Standardization (ISO), with the latest standard version ratified and published by ISO in October 2024 as ISO/IEC 14882:2024 (informally known as C++23). The C++ programming language was initially standardized in 1998 as ISO/IEC 14882:1998, which was then amended by the C++03, C++11, C++14, C++17, and C++20 standards. The current C++23 standard supersedes these with new features and an enlarged standard library. Before the initial standardization in 1998, C++ was developed by Stroustrup at Bell Labs since 1979 as an extension of the C language; he wanted an efficient and flexible language similar to C that also provided high-level features for program organization. Since 2012, C++ has been on a three-year release schedule with C++26 as the next planned standard.\r\nDespite its widespread adoption, some notable programmers have criticized the C++ language, including Linus Torvalds, Richard Stallman, Joshua Bloch, Ken Thompson, and Donald Knuth. This is largely due to its manual memory management, which makes it vulnerable to buffer overflow bugs, which represent a security risk."}}, {"model": "control.article", "pk": 3, "fields": {"title": "Python", "author": 1, "created": "2025-04-23T13:53:52.704Z", "synopsis": "Programming language", "content": "Python is a high-level, general-purpose programming language. Its design philosophy emphasizes code readability with the use of significant indentation.\r\nPython is dynamically type-checked and garbage-collected. It supports multiple programming paradigms, including structured (particularly procedural), object-oriented and functional programming. It is often described as a \"batteries included\" language due to its comprehensive standard library.\r\nGuido van Rossum began working on Python in the late 1980s as a successor to the ABC programming language and first released it in 1991 as Python 0.9.0. Python 2.0 was released in 2000. Python 3.0, released in 2008, was a major revision not completely backward-compatible with earlier versions. Python 2.7.18, released in 2020, was the last release of Python 2.\r\nPython consistently ranks as one of the most popular programming languages, and has gained widespread use in the machine learning community."}}, {"model": "control.article", "pk": 4, "fields": {"title": "United States", "author": 2, "created": "2025-04-23T13:57:29.307Z", "synopsis": "Country", "content": "The United States of America (USA), also known as the United States (U.S.) or America, is a country located primarily in North America. It is a federal republic of 50 states and the federal capital district of Washington, D.C. The 48 contiguous states border Canada to the north and Mexico to the south, with the semi-exclavic state of Alaska in the northwest and the archipelagic state of Hawaii in the Pacific Ocean. Indian country includes 574 federally recognized tribes and 326 Indian reservations with tribal sovereignty rights. The U.S. asserts sovereignty over five major island territories and various uninhabited islands in the Pacific Ocean and the Caribbean. It is an ecologically megadiverse country, with the world's third-largest land area and third-largest population, exceeding 340 million.\r\nPaleo-Indians migrated to North America across the Bering land bridge more than 12,000 years ago, and formed various cultures. Spanish Florida, the first European colony in what is now the continental U.S., was established in 1513, and later British colonization led to the first settlement of the Thirteen Colonies in Virginia in 1607. Intensive agriculture in the rapidly expanding Southern Colonies encouraged the enslavement of Africans. Clashes with the British Crown over taxation and political representation sparked the American Revolution, with the Second Continental Congress formally declaring independence on July 4, 1776. The U.S. emerged victorious from the American Revolutionary War of 1775 to 1783 and expanded westward across North America, dispossessing Native Americans during the Indian Wars. The Louisiana Purchase in 1803 and the end of the Mexican–American War in 1848 saw significant territorial acquisition. As more states were admitted, a North–South division over slavery led to the secession of the Confederate States of America, which fought the Union in the American Civil War of 1861 to 1865. With the Union's victory, slavery was abolished nationally. In the late 19th and early 20th centuries, the U.S. established itself as a great power following the Spanish–American War and World War I. After Japan's attack on Pearl Harbor in 1941, the U.S. entered World War II; its aftermath left the U.S. and the Soviet Union as the world's superpowers. During the Cold War, both countries struggled for ideological dominance and international influence. The Soviet Union's collapse and the end of the Cold War in 1991 left the U.S. as the world's sole superpower.\r\nThe U.S. national government, as established by the Constitution in 1789, is a presidential republic and liberal democracy with a separation of powers into three branches: legislative, executive, and judicial. The U.S. Congress, the national legislature, is composed of the House of Representatives (a lower house based on population) and the Senate (an upper house based on equal representation for each state). The U.S. federal system provides substantial autonomy to the 50 states, each with its own constitution and laws. The American political tradition is rooted in Enlightenment ideals of liberty, equality, individual rights, and the rule of law. Since the 1850s, the Democratic and Republican parties have dominated American politics.\r\nA developed country, the U.S. ranks high in economic competitiveness, productivity, innovation, and higher education. The U.S. accounted for over a quarter of nominal global economic output in 2024, and its economy has been the world's largest by nominal GDP since about 1890. It possesses the largest amount of wealth of any country and has the highest disposable household income per capita among OECD countries, though U.S. wealth inequality is one of the most pronounced in those countries. A melting pot of many ethnicities and customs, the culture of the U.S. has been shaped by centuries of immigration, and its soft power influence has a global reach. The U.S. is a member of multiple international organizations and plays a leading role in global political, cultural, economic, and military affairs."}}, {"model": "control.article", "pk": 5, "fields": {"title": "England", "author": 1, "created": "2025-04-23T14:06:37.104Z", "synopsis": "Country", "content": "England is a country that is part of the United Kingdom. It is located on the island of Great Britain, of which it covers about 62%, and more than 100 smaller adjacent islands. It shares a land border with Scotland to the north and another land border with Wales to the west, and is otherwise surrounded by the North Sea to the east, the English Channel to the south, the Celtic Sea to the south-west, and the Irish Sea to the west. Continental Europe lies to the south-east, and Ireland to the west. At the 2021 census, the population was 56,490,048. London is both the largest city and the capital.\r\nThe area now called England was first inhabited by modern humans during the Upper Paleolithic. It takes its name from the Angles, a Germanic tribe who settled during the 5th and 6th centuries. England became a unified state in the 10th century and has had extensive cultural and legal impact on the wider world since the Age of Discovery, which began during the 15th century. The Kingdom of England, which included Wales after 1535, ceased to be a separate sovereign state on 1 May 1707, when the Acts of Union brought into effect a political union with the Kingdom of Scotland that created the Kingdom of Great Britain.\r\nEngland is the origin of the English language, the English legal system (which served as the basis for the common law systems of many other countries), association football, and the Anglican branch of Christianity; its parliamentary system of government has been widely adopted by other nations. The Industrial Revolution began in 18th-century England, transforming its society into the world's first industrialised nation. England is home to the two oldest universities in the English-speaking world: the University of Oxford, founded in 1096, and the University of Cambridge, founded in 1209. Both universities are ranked among the most prestigious in the world.\r\nEngland's terrain chiefly consists of low hills and plains, especially in the centre and south. Upland and mountainous terrain is mostly found in the north and west, including Dartmoor, the Lake District, the Pennines, and the Shropshire Hills. The London metropolitan area has a population of 14.2 million as of 2021, representing the United Kingdom's largest metropolitan area. England's population of 56.3 million comprises 84% of the population of the United Kingdom, largely concentrated around London, the South East, and conurbations in the Midlands, the North West, the North East, and Yorkshire, which each developed as major industrial regions during the 19th century."}}, {"model": "control.article", "pk": 6, "fields": {"title": "Portugal", "author": 2, "created": "2025-04-23T14:10:58.751Z", "synopsis": "Country", "content": "Portugal, officially the Portuguese Republic, is a country in the Iberian Peninsula in Southwestern Europe. Featuring the westernmost point in continental Europe, Portugal borders Spain to its north and east, with which it shares the longest uninterrupted border in the European Union; to the south and the west is the North Atlantic Ocean; and to the west and southwest lie the Macaronesian archipelagos of the Azores and Madeira, which are the two autonomous regions of Portugal. Lisbon is the capital and largest city, followed by Porto, which is the only other metropolitan area.\r\nThe western part of the Iberian Peninsula has been continuously inhabited since prehistoric times, with the earliest signs of settlement dating to 5500 BC. Celtic and Iberian peoples arrived in the first millennium BC. The region came under Roman control in the second century BC, followed by a succession of Germanic peoples and the Alans from the fifth to eighth centuries AD. Muslims invaded mainland Portugal in the eighth century, but were gradually expelled by the Christian Reconquista culminating with the capture of the Algarve, between 1238 and 1249 AD. Modern Portugal began taking shape during this period, initially as a county of the Christian Kingdom of León in 868 and recognized unequivocally as a kingdom with Manifestis Probatum in 1179.\r\nAs one of the earliest participants in the Age of Discovery, Portugal made several advancements in nautical science, the discovery of the volta do mar, which unlocked safe round-trip voyages enabling deep-sea travel, stands out as a major turning point in world's history. It settled Madeira and the Azores, and established itself as a major economic and political power, largely through a maritime empire that extended mostly along the South Atlantic and Indian Ocean coasts. The Portuguese were among the first Europeans to explore and discover new territories and sea routes establishing a global commercial network of settlements, colonies, and trading posts. A dynastic crisis in the early 1580s resulted in the Iberian Union (1580–1640), which unified Portugal under Spanish rule, marking its gradual decline as a global power. Portuguese sovereignty was regained in 1640 and was followed by a costly and protracted war lasting until 1688, while the 1755 Lisbon earthquake destroyed the city and further damaged the empire's economy.\r\nThe Napoleonic Wars drove the relocation of the court to Brazil in 1807, leading to it's elevation from colony to kingdom which culminated with it's independence in 1822, triggering a civil war (1828–1834) between supporters for a constitutional monarchy and absolutist monarchists. The monarchy endured until the 5 October 1910 revolution, which replaced it with the First Republic. A phase of unrest ultimately led to it's replacement with the authoritarian Ditadura Nacional and then turned into the Estado Novo. Democracy was restored in 1974 following the Carnation Revolution, which brought an end to the Portuguese Colonial War and allowed the last of Portugal's African territories to achieve independence.\r\nPortugal's imperial history has left a vast cultural legacy, with around 300 million Portuguese speakers around the world. Today, it is a developed country with an advanced economy relying chiefly upon services, industry, and tourism. Portugal, a member of the United Nations, the European Union, the Schengen Area, and the Council of Europe, was one of the founding members of NATO, the eurozone, the OECD, and the Community of Portuguese Language Countries."}}, {"model": "control.article", "pk": 7, "fields": {"title": "Star Wars", "author": 3, "created": "2025-04-23T14:13:02.918Z", "synopsis": "Epic space opera media franchise", "content": "Star Wars is an American epic space opera media franchise created by George Lucas, which began with the eponymous 1977 film and quickly became a worldwide pop culture phenomenon. The franchise has been expanded into various films and other media, including television series, video games, novels, comic books, theme park attractions, and themed areas, comprising an all-encompassing fictional universe. Star Wars is one of the highest-grossing media franchises of all time.\r\nThe original 1977 film, retroactively subtitled Episode IV: A New Hope, was followed by the sequels Episode V: The Empire Strikes Back (1980) and Episode VI: Return of the Jedi (1983), forming the original Star Wars trilogy. Lucas later returned to the series to write and direct a prequel trilogy, consisting of Episode I: The Phantom Menace (1999), Episode II: Attack of the Clones (2002), and Episode III: Revenge of the Sith (2005). In 2012, Lucas sold his production company to Disney, relinquishing his ownership of the franchise. This led to a sequel trilogy, consisting of Episode VII: The Force Awakens (2015), Episode VIII: The Last Jedi (2017), and Episode IX: The Rise of Skywalker (2019).\r\nAll nine films, collectively referred to as the \"Skywalker Saga\", were nominated for Academy Awards, with Oscars going to the first three releases. Together with the theatrical live action \"anthology\" films Rogue One (2016) and Solo (2018), the combined box office revenue of the films equate to over US$10 billion, making Star Wars the third-highest-grossing film franchise in cinematic history."}}]